# 1. Дан список чисел. Определите, сколько в нем встречается различных чисел.
# [1, 1, 2, 3, 4, 4] -> 4


our_set = [1, 1, 2, 3, 4, 4]
print(len(set(our_set)))

